#include <stdio.h> //введення бібліотек
#include <locale.h>
#include <math.h>
  float y; //введення глобальної змінної
 int main() {
    float x,z; //введення змінної
    printf("Задайте число x="); //рядок для введення цілого числа x
    scanf("%f",&x); //cканування цілого числа
    printf("Задайте число z="); //рядок для введення цілого числа z
    scanf("%f",&z); //cканування цілого числа
    y=sqrt(log10((1-2*x)/(z+3))); //введення формули
    if (z <= -3 || x > 0 || (1 - 2 * x) < (z + 3))
    {
        printf("Не має вирішення.");
    } else {
        printf("Обчислення=%.2f \n", y); //виведення обчислення з формули  
    }
   return 0;
     }